// Используя JavaScript, добавьте обработчик события отправки формы (submit), который будет выполнять следующие действия:

//Отменять действие по умолчанию для события submit
//Отображать сообщение об ошибке рядом с каждым полем при обнаружении ошибки валидации
//Кнопка отправки должна быть неактивна (disabled), пока все поля формы не будут правильно заполнены и не будет отмечен чекбокс согласия с условиями
//Если форма проходит проверку валидности, выводите в консоль значения полей формы и очищайте форму
//4. Бонусное задание: реализуйте дополнительные обработчики событий focus и blur для каждого поля